# -*- coding: utf-8; -*-


**** evil-cleverparens
     #+BEGIN_SRC emacs-lisp
     (add-hook 'elisp-mode  #'evil-cleverparens-mode)
     (add-hook 'scheme-mode #'evil-cleverparens-mode)
     #+END_SRC

     #+RESULTS:
     | evil-cleverparens-mode |

* evil visual selection - evil 과 org mode 간에 상충 발생

  #+BEGIN_SRC emacs-lisp :tangle no
    (define-key evil-normal-state-map (kbd "S-<left>")
      (lambda ()
        (interactive)
        (evil-visual-char)
        (backward-char)))
    (define-key evil-normal-state-map (kbd "S-<right>") 
      (lambda ()
        (interactive)
        (evil-visual-char)
        (forward-char)))
    (define-key evil-normal-state-map (kbd "S-<up>")
      (lambda ()
        (interactive)
        (evil-visual-char)
        (previous-line)))
    (define-key evil-normal-state-map (kbd "S-<down>") 
      (lambda ()
        (interactive)
        (evil-visual-char)
        (next-line)))

  #+END_SRC

  #+RESULTS:
  | lambda | nil | (interactive) | (evil-visual-char) | (next-line) |

